
namespace Common.Enums
{
    public enum UserGroup
    { 
        //================================================
        /// <summary>
        /// مدیر سیستم
        /// </summary>
        Admin = 1,
        //================================================
        /// <summary>
        /// معلم
        /// </summary>
        Teacher = 2,
        //================================================
        /// <summary>
        /// دانشجویان 
        /// </summary>
        Student = 3,
        //================================================
        /// <summary>
        /// پشتیبان
        /// </summary>
        Supporter = 4 ,
        //=================================================
        /// <summary>
        /// همکار فروش
        /// </summary>
        SalesPartner =  5 , 
        //=================================================
        /// <summary>
        /// مشاور
        /// </summary>
        Consultant = 6
    }
}
